## ===================================================
## Tool 입력 데이터 유효성 검증을 위한 클래스 : Tool 스키마
## ==================================================

## -------------------------------------------
## 모듈 로딩
## -------------------------------------------
from pydantic import BaseModel, Field


## -------------------------------------------
## 클래스이름 : TravelInput
## 클래스역할 : Travel Tool의 입력 데이터 형태/규칙
## -------------------------------------------
class TravelInput(BaseModel):
    location: str = Field(description="추천받을 여행지 도시명 (예: 서울, 부산)")
