## ===================================================
## Tool 입력 데이터 유효성 검증을 위한 클래스 : Tool 스키마
## ==================================================

## -------------------------------------------
## 모듈 로딩
## -------------------------------------------
from pydantic import BaseModel, Field

## -------------------------------------------
## 클래스이름 : WeatherInput
## 클래스역할 : Weather Tool의 입력 데이터 형태/규칙
## -------------------------------------------
class WeatherInput(BaseModel):
    city: str = Field(description="날씨를 확인할 도시명 (예: 서울, 부산)")
